## Plan Result (prod-uksouth-prod)




<pre><code>Plan: 297 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.mailrelay.azurerm_private_dns_a_record.this[&#34;dev&#34;]
  * module.mailrelay.azurerm_private_dns_a_record.this[&#34;prod&#34;]
  * module.mailrelay.azurerm_private_dns_a_record.this[&#34;prod-in&#34;]
  * module.mailrelay.azurerm_private_dns_cname_record.this[&#34;dev-in&#34;]
  * module.mailrelay.azurerm_private_dns_cname_record.this[&#34;prod-in&#34;]
  * module.mailrelay.azurerm_private_dns_zone.zone[0]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.mailrelay-internal.azurerm_private_dns_a_record.this[&#34;dev-in-uks&#34;]
  * module.mailrelay-internal.azurerm_private_dns_a_record.this[&#34;dev-in-ukw&#34;]
  * module.mailrelay-internal.azurerm_private_dns_a_record.this[&#34;prod-in-uks&#34;]
  * module.mailrelay-internal.azurerm_private_dns_a_record.this[&#34;prod-in-ukw&#34;]
  * module.mailrelay-internal.azurerm_private_dns_cname_record.this[&#34;dev-in&#34;]
  * module.mailrelay-internal.azurerm_private_dns_cname_record.this[&#34;prod-in&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone.zone[0]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-aad-domain-services-mgmt-vnet&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.platform-prod.azurerm_private_dns_a_record.this[&#34;vh-wowza&#34;]
  * module.platform-prod.azurerm_private_dns_zone.zone[0]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-prod&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-prod-vnet&#34;]
  * module.platform-prod.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-prod-vnet&#34;]
  * module.prod-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.prod-internal.azurerm_private_dns_zone.zone[0]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-prod-vnet&#34;]
  * module.prod-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;aat-waf&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;aks-mgmt-prod-proxyin&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;aks-mgmt-sandbox-proxyin&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-00&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-01&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-ptl&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;artifactory&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;backstage&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;build-beta&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;build-failure-analyzer&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;camunda-bpm&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;camunda-optimize&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ccd-admin-web&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ccpay-demo-waf&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ccpay-waf&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;cft-api-mgmt&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ctsc-web-forms-ui-stg&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;demo-waf-3&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;dm-store-prod.service&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;docmosis&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;docmosis-stg&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;grafana-ptl&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;idam-bastion&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-prod&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-prod-a&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-prod-b&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-sandbox&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-sandbox-a&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;mgmt-jenkins-sandbox-b&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;netbox&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;nexpose-console&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;pact-broker&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;portal&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;preview-waf&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;prod-waf&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;prod-waf-additional&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;prometheus-00&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;prometheus-01&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;prometheus-ptl&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;registration&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;response&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;response-api&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sandbox-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sandbox-build-beta&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sandbox-build-failure-analyzer&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-00&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-00-ptl&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-01&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-api-mgmt&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-grafana&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-00&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-00-ptl&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-01&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sds-sandbox-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sftp&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;siem&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;sod-ss&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;static-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;static-sandbox-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;static-sds-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;static-sds-sandbox-build&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;tenable-sc&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;traefik-int-stg&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-00&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-01&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;uksouth-prod-palo-0&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;uksouth-prod-palo-1&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ukwest-prod-palo-0&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;ukwest-prod-palo-1&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;vh-wowza&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;vpn&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;vpn-ext&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;www.featuretoggle&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;www.featuretoggle.sprod&#34;]
  * module.prod-platform.azurerm_private_dns_a_record.this[&#34;www.registration&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;apply-for-adoption&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;apply-for-probate&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;awverify.sscs&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bar&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bastion-dev-nonprod&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bastion-dev-sbox&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bastion-devops-prod&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bulkscan&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bulkscan.saat&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;bulkscan.sprod&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;c100-application&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;equality-and-diversity&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;fees-register&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;fees-register-api&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;gateway.ccd&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-api&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-api.preview&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-admin.preview&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-public.preview&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;in-court-presentation&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;log-and-audit&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;manage-case&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;manage-org&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;manage-payments&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;paybubble&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;payment&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;pip-frontend&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;plum&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;reformscan&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;register-org&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;return-case-doc.ccd&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00-api&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01-api&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sscs&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;sslmon&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmadminister-orgs&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmequality-and-diversity&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmmanage-case&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmmanage-org&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmpaybubble&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmwww.apply-for-probate&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmwww.fees-register&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmwww.fees-register-api&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;tmwww.manage-payments&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;vh-admin-web&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;vh-service-web&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;vh-test-web&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;vh-video-web&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.apply-for-probate&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.bar&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.ccd&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.equality-and-diversity&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.fees-register&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.manage-payments&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.moneyclaim-legal&#34;]
  * module.prod-platform.azurerm_private_dns_cname_record.this[&#34;www.paybubble&#34;]
  * module.prod-platform.azurerm_private_dns_zone.zone[0]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-sbox-vnet&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-idam-internal&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-idam-internal&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-prod&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;pet-prod-vnet&#34;]
  * module.prod-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.prod2-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5cc&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5demo&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5dev&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5perim&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5stage&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlf5test&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlsftp01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betanlsftp02&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betapreprodbackup01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betapreprodf5cc&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betapreprodf5internal&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betapreprodf5perim&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betapreprodsftp01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodbackup01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodf5cc&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodf5internal&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodf5perim&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodfailover01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;betaprodsftp01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;demof5lb&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;devf5lb&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;preprodf5lb&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;prodf5lb&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevbastion02&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsadmin01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbackup01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbackup03&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbastion&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbuildagent01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsdns01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsdns02&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsjenkins01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsldap01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtf5internal&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtf5perim&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtmta&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtproxyin&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;reformmgmtproxyout&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;refromsscssftpvm01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;servicenowmid01&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;sftp&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;sftp-dev&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;sftp-prod&#34;]
  * module.reform.azurerm_private_dns_a_record.this[&#34;testf5lb&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;backup1&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;backup2&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;bastion&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;dashboard&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;demoproxyin&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;ldap&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;mgmtf5int&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;mgmtf5perim&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;mta&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;password&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;passwordchange&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;prod-build&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;prodproxyin&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;proxyin&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;proxyout&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;reformmgmtadmin01&#34;]
  * module.reform.azurerm_private_dns_cname_record.this[&#34;reformmgmtdevbastion&#34;]
  * module.reform.azurerm_private_dns_zone.zone[0]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-aat-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-demo-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat2-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-demo-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-preview-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-idam-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-idam-internal&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.mailrelay.azurerm_private_dns_a_record.this["dev"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev"
      + records             = [
          + "20.49.168.141",
          + "20.49.168.17",
          + "51.11.124.149",
          + "51.11.124.158",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "mailrelay.platform.hmcts.net"
    }

  # module.mailrelay.azurerm_private_dns_a_record.this["prod"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod"
      + records             = [
          + "20.50.108.242",
          + "20.50.109.148",
          + "51.11.124.205",
          + "51.11.124.216",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "mailrelay.platform.hmcts.net"
    }

  # module.mailrelay.azurerm_private_dns_a_record.this["prod-in"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-in"
      + records             = [
          + "51.132.173.173",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "mailrelay.platform.hmcts.net"
    }

  # module.mailrelay.azurerm_private_dns_cname_record.this["dev-in"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev-in"
      + record              = "ss-dev-mailrelay.trafficmanager.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "mailrelay.platform.hmcts.net"
    }

  # module.mailrelay.azurerm_private_dns_cname_record.this["prod-in"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-in"
      + record              = "ss-prod-mailrelay.trafficmanager.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "mailrelay.platform.hmcts.net"
    }

  # module.mailrelay.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "mailrelay.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.mailrelay.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "mailrelay.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.mailrelay-internal.azurerm_private_dns_a_record.this["dev-in-uks"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev-in-uks"
      + records             = [
          + "10.11.69.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_a_record.this["dev-in-ukw"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev-in-ukw"
      + records             = [
          + "10.49.69.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_a_record.this["prod-in-uks"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-in-uks"
      + records             = [
          + "10.11.5.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_a_record.this["prod-in-ukw"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-in-ukw"
      + records             = [
          + "10.49.5.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_cname_record.this["dev-in"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dev-in"
      + record              = "dev-in-uks.mailrelay.internal.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_cname_record.this["prod-in"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-in"
      + record              = "prod-in-uks.mailrelay.internal.platform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "mailrelay.internal.platform.hmcts.net"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "mailrelay.internal.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-aad-domain-services-mgmt-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-aad-domain-services-mgmt-vnet"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/core-aad-domain-services-mgmt-rg/providers/Microsoft.Network/virtualNetworks/core-aad-domain-services-mgmt-vnet"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.mailrelay-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "mailrelay.internal.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.platform-prod.azurerm_private_dns_a_record.this["vh-wowza"] will be created
  + resour

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

m_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevbastion"
      + record              = "reformmgmtdevbastion02.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.reform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "reform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-aat-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-demo-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-demo-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-demo/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-demo"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat2-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat2-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-demo-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-demo-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-demo/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-demo"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-preview-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-preview"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod2"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod2"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-idam-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-preview-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-prod-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-prod-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-idam-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-platform"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 297 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"prod-uksouth-prod","Vars":{}} -->